app/views/posts/index.html.erb

<% if !params[:author].blank? %>
  <% @posts = Post.where(author: params[:author]) %>
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE "author"."author" = ?  [["author", "16"]]

  <% if params[:date] == "Today" %>
    <% @posts = Post.where("create_at >=?", Time.zone.today.beginning_of_day) %>
---
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')